una1veritas/ARMWork/STM32Libraries/Utilities/STM32_Audio/STM322xG_EVAL/stm322xg_clk_synthesizer_cs2200.c
  /* Disable DMA TX Channel */
  DMA_Cmd(CLK_SYNTH_I2C_DMA_STREAM_TX, DISABLE);
  
  /* Wait until CLK_SYNTH_I2C_DMA_STREAM_TX disabled or time out */
  Timeout = CLK_SYNTH_FLAG_TIMEOUT;
  while (DMA_GetCmdStatus(CLK_SYNTH_I2C_DMA_STREAM_TX)!= DISABLE)
  {
    if((Timeout--) == 0) return CLK_SYNTH_TIMEOUT_UserCallback();   
  }
  
  /* Clear any pending flag on Tx Stream  */
  DMA_ClearFlag(CLK_SYNTH_I2C_DMA_STREAM_TX, CLK_SYNTH_I2C_TX_DMA_TCFLAG | CLK_SYNTH_I2C_TX_DMA_FEIFLAG | CLK_SYNTH_I2C_TX_DMA_DMEIFLAG | \
                                       CLK_SYNTH_I2C_TX_DMA_TEIFLAG | CLK_SYNTH_I2C_TX_DMA_HTIFLAG);
#endif /* USE_I2C_DMA_TC_IT */  
  
  /* Return the verifying value: 0 (Passed) or 1 (Failed) */
  return result;
}

#ifdef USE_I2C_DMA_TC_IT
/**
  * @brief  This function handles CLK_SYNTH_I2C_DMA_TX_IRQHandler global interrupt request.
  * @param  None
  * @retval None
  */
void CLK_SYNTH_I2C_DMA_TX_IRQHandler(void)
{
  /* check if DMA Transfer Complete occurred */
  if (DMA_GetFlagStatus(CLK_SYNTH_I2C_DMA_STREAM_TX, CLK_SYNTH_I2C_TX_DMA_TCFLAG) == SET)
  {  
    /* I2C DMA Disable */
    I2C_DMACmd(CLK_SYNTH_I2C, DISABLE);
    
    ///  /* Wait until BTF Flag is set before generating STOP or time out */
    //  Timeout = CLK_SYNTH_FLAG_TIMEOUT;
    //  while (!I2C_GetFlagStatus(CLK_SYNTH_I2C, I2C_FLAG_BTF)) 
    //  {
    //    if((Timeout--) == 0) return CLK_SYNTH_TIMEOUT_UserCallback();   
    //  }
    
    /* Send STOP Condition */
    I2C_GenerateSTOP(CLK_SYNTH_I2C, ENABLE);
    
    /* Disable DMA TX Channel */
    DMA_Cmd(CLK_SYNTH_I2C_DMA_STREAM_TX, DISABLE);
    
    ///    /* Wait until CLK_SYNTH_I2C_DMA_STREAM_TX disabled or time out */
    //    Timeout = CLK_SYNTH_FLAG_TIMEOUT;
    //    while (DMA_GetCmdStatus(CLK_SYNTH_I2C_DMA_STREAM_TX)!= DISABLE)
    //    {
    //      if((Timeout--) == 0) return CLK_SYNTH_TIMEOUT_UserCallback();   
    //    }
    
    /* Clear any pending flag on Tx Stream  */
    DMA_ClearFlag(CLK_SYNTH_I2C_DMA_STREAM_TX, CLK_SYNTH_I2C_TX_DMA_TCFLAG | CLK_SYNTH_I2C_TX_DMA_FEIFLAG | CLK_SYNTH_I2C_TX_DMA_DMEIFLAG | \
      CLK_SYNTH_I2C_TX_DMA_TEIFLAG | CLK_SYNTH_I2C_TX_DMA_HTIFLAG);
  }
}
#endif /* USE_I2C_DMA_TC_IT */

/**
  * @brief  CLK_SYNTH_DMAConfig
  *         Initialize the I2C DMA channels.
  * @param  None.
  * @retval None.
  */
static void CLK_SYNTH_DMAConfig(void)
{
  NVIC_InitTypeDef NVIC_InitStructure;
  
  /* Clear any pending flag on Tx Stream  */
  DMA_ClearFlag(CLK_SYNTH_I2C_DMA_STREAM_TX, CLK_SYNTH_I2C_TX_DMA_TCFLAG | CLK_SYNTH_I2C_TX_DMA_FEIFLAG | CLK_SYNTH_I2C_TX_DMA_DMEIFLAG | \
    CLK_SYNTH_I2C_TX_DMA_TEIFLAG | CLK_SYNTH_I2C_TX_DMA_HTIFLAG);
  
  /* Clear any pending flag on Rx Stream  */
  DMA_ClearFlag(CLK_SYNTH_I2C_DMA_STREAM_RX, CLK_SYNTH_I2C_RX_DMA_TCFLAG | CLK_SYNTH_I2C_RX_DMA_FEIFLAG | CLK_SYNTH_I2C_RX_DMA_DMEIFLAG | \
    CLK_SYNTH_I2C_RX_DMA_TEIFLAG | CLK_SYNTH_I2C_RX_DMA_HTIFLAG);
  
  /* Disable the I2C Tx DMA stream */
  DMA_Cmd(CLK_SYNTH_I2C_DMA_STREAM_TX, DISABLE);
  /* Configure the DMA stream for the I2C peripheral TX direction */
  DMA_DeInit(CLK_SYNTH_I2C_DMA_STREAM_TX);
  
  /* Disable the I2C Rx DMA stream */
  DMA_Cmd(CLK_SYNTH_I2C_DMA_STREAM_RX, DISABLE);
  /* Configure the DMA stream for the I2C peripheral RX direction */
  DMA_DeInit(CLK_SYNTH_I2C_DMA_STREAM_RX);
  
  /* Initialize the DMA Structure common fields */
  DMA_InitStructure.DMA_Channel = CLK_SYNTH_I2C_DMA_CHANNEL;
  DMA_InitStructure.DMA_PeripheralBaseAddr = CLK_SYNTH_I2C_DR_ADDRESS;       
  DMA_InitStructure.DMA_PeripheralInc = DMA_PeripheralInc_Disable;
  DMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Enable;
  DMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_Byte;
  DMA_InitStructure.DMA_MemoryDataSize = DMA_MemoryDataSize_Byte;
  DMA_InitStructure.DMA_Mode = DMA_Mode_Normal;
  DMA_InitStructure.DMA_Priority = DMA_Priority_VeryHigh;
  DMA_InitStructure.DMA_FIFOMode = DMA_FIFOMode_Disable;
  DMA_InitStructure.DMA_FIFOThreshold = DMA_FIFOThreshold_Full;
  DMA_InitStructure.DMA_MemoryBurst = DMA_MemoryBurst_Single;
  DMA_InitStructure.DMA_PeripheralBurst = DMA_PeripheralBurst_Single;
  
  /* Init DMA for Transmission */
  DMA_InitStructure.DMA_DIR = DMA_DIR_MemoryToPeripheral;
  DMA_InitStructure.DMA_Memory0BaseAddr = (uint32_t)TxBuffer;
  DMA_InitStructure.DMA_BufferSize = 0xFFFF;
  DMA_Init(CLK_SYNTH_I2C_DMA_STREAM_TX, &DMA_InitStructure);   
  
  /* Init DMA for Reception */
  DMA_InitStructure.DMA_DIR = DMA_DIR_PeripheralToMemory;
  DMA_InitStructure.DMA_Memory0BaseAddr = (uint32_t)RxBuffer;
  DMA_InitStructure.DMA_BufferSize = 0xFFFF;
  DMA_Init(CLK_SYNTH_I2C_DMA_STREAM_RX, &DMA_InitStructure); 

#ifdef USE_I2C_DMA_TC_IT  
  /* Enable the interrupt of I2C DMA TX Stream */
  DMA_ITConfig(CLK_SYNTH_I2C_DMA_STREAM_TX, DMA_IT_TC, ENABLE);
  
  /* Enable the I2C DMA TX Stream Interrupt */
  NVIC_InitStructure.NVIC_IRQChannel = CLK_SYNTH_I2C_DMA_TX_IRQn;
  NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = STM32_CLK_SYNTH_PRE_PRIO;
  NVIC_InitStructure.NVIC_IRQChannelSubPriority = STM32_CLK_SYNTH_SUB_PRIO;
  NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
  NVIC_Init(&NVIC_InitStructure);  
#endif /* USE_I2C_DMA_TC_IT */
}

/**
  * @brief  CLK_SYNTH_GPIO_Init
  *         Initialize the I2C IOs.
  * @param  None.
  * @retval None.
  */
static void CLK_SYNTH_GPIO_Init(void)
{
  GPIO_InitTypeDef GPIO_InitStructure;
  
  /* Enable I2S and I2C GPIO clocks */
  RCC_AHB1PeriphClockCmd(CLK_SYNTH_I2C_GPIO_CLOCK, ENABLE);

  /* CLK_SYNTH_I2C SCL and SDA pins configuration -------------------------------------*/
  GPIO_InitStructure.GPIO_Pin = CLK_SYNTH_I2C_SCL_PIN | CLK_SYNTH_I2C_SDA_PIN; 
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_InitStructure.GPIO_OType = GPIO_OType_OD;
  GPIO_InitStructure.GPIO_PuPd  = GPIO_PuPd_NOPULL;
  GPIO_Init(CLK_SYNTH_I2C_GPIO, &GPIO_InitStructure);     
  /* Connect pins to Periph */
  GPIO_PinAFConfig(CLK_SYNTH_I2C_GPIO, CLK_SYNTH_I2C_SCL_PINSRC, CLK_SYNTH_I2C_GPIO_AF);  
  GPIO_PinAFConfig(CLK_SYNTH_I2C_GPIO, CLK_SYNTH_I2C_SDA_PINSRC, CLK_SYNTH_I2C_GPIO_AF);
}

/**
  * @brief Restores the IOs used by the Audio Codec interface to their default 
  *        state
  * @param  None.
  * @retval None.
  */
static void CLK_SYNTH_GPIO_DeInit(void)
{
  /* I2C IOs are not deinitialized because it may be used by other modules */    
}

/**
  * @brief Initializes the control interface (I2C).
  * @param  None.
  * @retval None.
  */
static void CLK_SYNTH_CtrlInterface_Init(void)
{
  I2C_InitTypeDef I2C_InitStructure;
  
  /* Enable the CLK_SYNTH_I2C peripheral clock */
  RCC_APB1PeriphClockCmd(CLK_SYNTH_I2C_CLK, ENABLE);
  
